STMicroelectronics/STM32CubeU5/Projects/B-U585I-IOT02A/Demonstrations/IOT_HTTP_WebServer/Core/Inc/stm32u5xx_hal_conf.h
/**
  **********************************************************************************************************************
  * @file    stm32u5xx_hal_conf.h
  * @author  MCD Application Team
  * @brief   HAL configuration file.
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2021-2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  */

/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/
#ifndef STM32U5xx_HAL_CONF_H
#define STM32U5xx_HAL_CONF_H

#ifdef __cplusplus
 extern "C" {
#endif

/* Exported types ----------------------------------------------------------------------------------------------------*/
/* Exported constants ------------------------------------------------------------------------------------------------*/

/* ########################## Module Selection ############################## */
/**
  * @brief This is the list of modules to be used in the HAL driver
  */

#define HAL_MODULE_ENABLED
/*#define HAL_ADC_MODULE_ENABLED       */
/*#define HAL_MDF_MODULE_ENABLED       */
/*#define HAL_MDF_MODULE_ENABLED       */
/*#define HAL_COMP_MODULE_ENABLED      */
/*#define HAL_CORDIC_MODULE_ENABLED    */
/*#define HAL_CRC_MODULE_ENABLED       */
/*#define HAL_CRYP_MODULE_ENABLED      */
/*#define HAL_DAC_MODULE_ENABLED       */
/*#define HAL_FDCAN_MODULE_ENABLED     */
/*#define HAL_FMAC_MODULE_ENABLED      */
/*#define HAL_GTZC_MODULE_ENABLED      */
/*#define HAL_HASH_MODULE_ENABLED      */
/*#define HAL_IRDA_MODULE_ENABLED      */
/*#define HAL_IWDG_MODULE_ENABLED      */
#define HAL_I2C_MODULE_ENABLED
/*#define HAL_I2S_MODULE_ENABLED       */
#define HAL_LPTIM_MODULE_ENABLED
/*#define HAL_NAND_MODULE_ENABLED      */
/*#define HAL_NOR_MODULE_ENABLED       */
/*#define HAL_OPAMP_MODULE_ENABLED     */
/*#define HAL_OSPI_MODULE_ENABLED      */
/*#define HAL_OSPI_MODULE_ENABLED      */
/*#define HAL_OTFDEC_MODULE_ENABLED    */
/*#define HAL_PCD_MODULE_ENABLED       */
/*#define HAL_PKA_MODULE_ENABLED       */
#define HAL_RNG_MODULE_ENABLED
#define HAL_RTC_MODULE_ENABLED
/*#define HAL_SAI_MODULE_ENABLED       */
/*#define HAL_SD_MODULE_ENABLED        */
/*#define HAL_MMC_MODULE_ENABLED       */
/*#define HAL_SMARTCARD_MODULE_ENABLED */
/*#define HAL_SMBUS_MODULE_ENABLED     */
#define HAL_SPI_MODULE_ENABLED
/*#define HAL_SRAM_MODULE_ENABLED      */
/*#define HAL_TIM_MODULE_ENABLED       */
/*#define HAL_TSC_MODULE_ENABLED       */
/*#define HAL_RAMCFG_MODULE_ENABLED    */
#define HAL_UART_MODULE_ENABLED
/*#define HAL_USART_MODULE_ENABLED     */
/*#define HAL_WWDG_MODULE_ENABLED      */
/*#define HAL_DCMI_MODULE_ENABLED      */
/*#define HAL_PSSI_MODULE_ENABLED      */
#define HAL_GPIO_MODULE_ENABLED
#define HAL_EXTI_MODULE_ENABLED
#define HAL_DMA_MODULE_ENABLED
#define HAL_RCC_MODULE_ENABLED
#define HAL_FLASH_MODULE_ENABLED
#define HAL_PWR_MODULE_ENABLED
#define HAL_CORTEX_MODULE_ENABLED
#define HAL_ICACHE_MODULE_ENABLED
/*#define HAL_DCMI_MODULE_ENABLED      */

/* ########################## Oscillator Values adaptation ####################*/
/**
  * @brief Adjust the value of External High Speed oscillator (HSE) used in your application.
  *        This value is used by the RCC HAL module to compute the system frequency
  *        (when HSE is used as system clock source, directly or through the PLL).
  */
#if !defined  (HSE_VALUE)
  #define HSE_VALUE    (16000000U) /*!< Value of the External oscillator in Hz */
#endif /* HSE_VALUE */

#if !defined  (HSE_STARTUP_TIMEOUT)
  #define HSE_STARTUP_TIMEOUT    (100U)   /*!< Time out for HSE start up, in ms */
#endif /* HSE_STARTUP_TIMEOUT */

/**
  * @brief Internal Multiple Speed oscillator (MSI) default value.
  *        This value is the default MSI range value after Reset.
  */
#if !defined  (MSI_VALUE)
  #define MSI_VALUE              4000000U /*!< Value of the Internal oscillator in Hz*/
#endif /* MSI_VALUE */

/**
  * @brief Internal High Speed oscillator (HSI) value.
  *        This value is used by the RCC HAL module to compute the system frequency
  *        (when HSI is used as system clock source, directly or through the PLL).
  */
#if !defined  (HSI_VALUE)
  #define HSI_VALUE    (16000000U) /*!< Value of the Internal oscillator in Hz*/
#endif /* HSI_VALUE */

/**
  * @brief Internal High Speed oscillator (HSI48) value for USB FS and RNG.
  *        This internal oscillator is mainly dedicated to provide a high precision clock to
  *        the USB peripheral by means of a special Clock Recovery System (CRS) circuitry.
  *        When the CRS is not used, the HSI48 RC oscillator runs on it default frequency
  *        which is subject to manufacturing process variations.
  */
#if !defined  (HSI48_VALUE)
  #define HSI48_VALUE   (48000000U) /*!< Value of the Internal High Speed oscillator for USB FS/RNG in Hz.
                                               The real value my vary depending on manufacturing process variations.*/
#endif /* HSI48_VALUE */

/**
  * @brief Internal Low Speed oscillator (LSI) value.
  */
#if !defined  (LSI_VALUE)
#define LSI_VALUE  (32000U)     /*!< LSI Typical Value in Hz*/
#endif /* LSI_VALUE */                     /*!< Value of the Internal Low Speed oscillator in Hz
                                                The real value may vary depending on the variations
                                                in voltage and temperature.*/
/**
  * @brief External Low Speed oscillator (LSE) value.
  *        This value is used by the UART, RTC HAL module to compute the system frequency
  */
#if !defined  (LSE_VALUE)
#define LSE_VALUE  (32768U)    /*!< Value of the External Low Speed oscillator in Hz */
#endif /* LSE_VALUE */

#if !defined  (LSE_STARTUP_TIMEOUT)
#define LSE_STARTUP_TIMEOUT    (5000U)   /*!< Time out for LSE start up, in ms */
#endif /* LSE_STARTUP_TIMEOUT */

/**
  * @brief External clock source for I2S and SAI peripherals
  *        This value is used by the I2S and SAI HAL modules to compute the I2S and SAI clock source
  *        frequency, this source is inserted directly through I2S_CKIN pad.
  */
#if !defined  (EXTERNAL_SAI1_CLOCK_VALUE)
#define EXTERNAL_SAI1_CLOCK_VALUE    (48000U) /*!< Value of the SAI1 External clock source in Hz*/
#endif /* EXTERNAL_SAI1_CLOCK_VALUE */

